from string import punctuation

RU_32 = [
  'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п',
  'р', 'с', 'т', 'у', 'х', 'ц', 'ч', 'ш', 'щ', 'ы', 'ь', 'э', 'ю', 'я', ' '
]; assert len(RU_32) == 31, f"Expected 31, got {len(RU_32)}"

# RU_PUNCT_64 = RU_32 + [
#   'ё', '0', '1',  '2', '3', '4', '5', '6', '7', '8', '9', '0', '.', ',', '!', '?',
#   ':', '%', '\n', '+', '-', '=', '@', '[', ']', '(', ')', '<', '>', '_', '#', '*'
# ]; assert len(RU_PUNCT_64) == 64, f"Expected 64, got {len(RU_PUNCT_64)}"

# RU_ALPHA_64 = RU_32 + [
#   'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П',
#   'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', '\n'
# ]; assert len(RU_ALPHA_64) == 64, f"Expected 64, got {len(RU_ALPHA_64)}"

# RU_128 = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
# RU_128 += RU_128.upper()
# RU_128 += ' \n'
# RU_128 += '0123456789'
# RU_128 += punctuation
# RU_128 = list(RU_128)
# assert len(RU_128) <= 128, f"Expected <=128, got {len(RU_128)}"
# assert len(set(RU_128)) == len(RU_128), f"Expected unique"
