RU_32 = [
  'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п',
  'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ы', 'ь', 'э', 'ю', 'я', ' '
]; assert len(RU_32) == 32, f"Expected 32, got {len(RU_32)}"

RU_PUNCT_64 = RU_32 + [
  'ё', '0', '1',  '2', '3', '4', '5', '6', '7', '8', '9', '0', '.', ',', '!', '?',
  ':', '%', '\n', '+', '-', '=', '@', '[', ']', '(', ')', '<', '>', '_', '#', '*'
]; assert len(RU_PUNCT_64) == 64, f"Expected 64, got {len(RU_PUNCT_64)}"

RU_ALPHA_64 = RU_32 + [
  'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П',
  'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', '\n'
]; assert len(RU_ALPHA_64) == 64, f"Expected 64, got {len(RU_ALPHA_64)}"
